blog/notetaking.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The self-corrective approach to learning</title>
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/png" href="/images/favicon.png">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Lora:ital,wght@0,400;0,600;1,400&display=swap" rel="stylesheet">
<link rel="stylesheet" href="../blog.css">
</head>
<body>
<div id="content" class="content">
<div class="page-wrap">
<a href="../blog.html" class="back">← all posts</a>
<header class="post-header">
  <span class="post-label">ai</span>
  <h1 class="post-title">The self-corrective approach to learning</h1>
  <div class="post-meta">
    <span>02 Jan 2026</span>
    <span class="post-meta-sep">·</span>
    <span>8 min read</span>
    <span class="post-meta-sep">·</span>
    <span>vmargb</span>
  </div>
</header>
<div id="outline-container-orgdb5544f" class="outline-2">
<h2 id="orgdb5544f">Evidence</h2>
<div class="outline-text-2" id="text-orgdb5544f">
<p>
This learning system is anecdotal, but it does align with evidence-based meta-learning principles such as:
</p>
<ul class="org-ul">
<li><b>Constructivism</b> - knowledge is constructed by you. Instead of simply absoring information or copying/rewriting, the explanation only comes from your memory [1]</li>

<li><b>Errorful generation</b> - generating your own explanation that is initially <b>wrong/incomplete</b> actually produces stronger memory once it is corrected. Correcting yourself is better for deeper understanding than getting it right the first time [2]</li>

<li><b>Successive elaboration</b> - successively self-correcting your explanation over multiple passes leads to deeper 'encoding' of the concept by creating richer memory traces [3]</li>

<li><b>Desirable difficulties</b> - Instead of copying, make the model <b>personal</b> &amp; “dumbified”, which more realistically resembles your current understanding with the concept [4]</li>

<li><b>The Feynman technique</b> - <b>teach</b> your current explanation(even if its wrong) without your notes, which improves active recall and exposes gaps in your explanation [5]</li>

<li><b>Contextual learning</b> - use real practical examples &amp; use-cases as <b>context</b> for each concept [6]</li>
</ul>
</div>
</div>
<div id="outline-container-orgab5ceb6" class="outline-2">
<h2 id="orgab5ceb6">Self-Corrective learning</h2>
<div class="outline-text-2" id="text-orgab5ceb6">
</div>
<div id="outline-container-orgea4e580" class="outline-3">
<h3 id="orgea4e580">Core Philosophy</h3>
<div class="outline-text-3" id="text-orgea4e580">
<ol class="org-ol">
<li><b>Memory First</b>: Write your model <b>before</b> consulting notes (after a delay). Wrong is okay.</li>
<li><b>Iterate</b>: Each concept goes through versions (v1, v2, v3&#x2026;) until mastery.</li>
<li><b>Schedule</b>: Reviews happen at specific intervals (1 day → 3 days → 1 week → 1 month).</li>
</ol>
</div>
</div>
<div id="outline-container-orgad871e9" class="outline-3">
<h3 id="orgad871e9">Basic Idea</h3>
<div class="outline-text-3" id="text-orgad871e9">
<p>
The essence of this method is:
</p>
<ol class="org-ol">
<li><b>Your Model</b>: For each concept, write down your own personal version of the concept. Don't try to sound perfect or formal, just write it down in the most <b>'frictionless'</b> way possible(exactly as it appears in your mind) <i>even</i> if it is <b>wrong</b>. Treat it as a brain dump.</li>

<li><p>
<b>Self Iterate</b>: This is just "version 1" of your model, and now you will self-iterate your model through <b>multiple passes</b>. So whenever you notice something missing or something that needs to be corrected, or a new connection you've discovered, you refine your model.
</p>

<p>
<b>Note: This model is only for you, so feel free to make it sound as silly and personal as possible. Assume you could read it 6 months later and understand exactly what you meant when you wrote it.</b>
</p></li>
</ol>
</div>
</div>
<div id="outline-container-org0ac7514" class="outline-3">
<h3 id="org0ac7514">Format/Structure</h3>
<div class="outline-text-3" id="text-org0ac7514">
<p>
Create a google doc, notion, obsidian etc. with the following structure:
</p>
</div>
</div>
<div id="outline-container-orgf71f712" class="outline-3">
<h3 id="orgf71f712">First section (Index)</h3>
<div class="outline-text-3" id="text-orgf71f712">
<p>
A list of every concept as you see them. Add a hyperlink for each one, that jumps you to the concept header/file.
</p>
</div>
</div>
<div id="outline-container-org4a45de5" class="outline-3">
<h3 id="org4a45de5">Second section (Concepts):</h3>
<div class="outline-text-3" id="text-org4a45de5">
<p>
Dedicate a chapter(or a file) to each concept with these subsections:
</p>
</div>
</div>
<div id="outline-container-org0c36d6e" class="outline-3">
<h3 id="org0c36d6e">My Model (recursively improve):</h3>
<div class="outline-text-3" id="text-org0c36d6e">
<p>
After encountering a new concept, without copying, write down the first mental picture that pops up into your mind, but only do this after a couple hours to a day(so that it really comes from your memory). This should easily be understood <b>without any friction</b>, so make it as personal as possible. Write as if nobody else would understand except for your mind alone.
</p>
</div>
</div>
<div id="outline-container-orgca43beb" class="outline-3">
<h3 id="orgca43beb">Inbox:</h3>
<div class="outline-text-3" id="text-orgca43beb">
<ul class="org-ul">
<li><b>Reading Inbox:</b> Store articles, books and any other resource links you plan to read and jot down what you learned from these material. Use this research/find answers to problems in your writing inbox below.</li>

<li><b>Writing Inbox:</b> This is where you collect incomplete thoughts. A checklist of any question that arises, things that still feel <i>fuzzy</i>, no matter how silly the question is. Then research/find answers to insert into your model (from memory)</li>

<li><b>Feynman Log:</b> This technique allows you to expose gaps in your explanation by finding what you failed to explain, note the exact sentence/step where you failed, and if any <b>gaps</b> arose in your explanation, write down what this gap was so you can correct it later. If you simply just forgot what to say, your model is not <i>dumbified</i> or simple enough, make it even more personal and understandable until its completely easy to recall. Remember to not be formal at all.</li>
</ul>
</div>
</div>
<div id="outline-container-org928795e" class="outline-3">
<h3 id="org928795e">Hidden knowledge</h3>
<div class="outline-text-3" id="text-org928795e">
<p>
It's impossible to fit everything that there is to say about about a concept into one page. An unwritten rule is that authors purposefully embed extra lessons into the <b>exercises</b> that is left for you to discover on your own. These extra lessons which I'm going to call <b>"hidden knowledge"</b> give you the complete picture, which is stuff that you're usually tested on. The problem is, we never keep track of or write this down as we discover them. It's your job to make a list of each of these discoveries and insert them into your model.
</p>
</div>
</div>
</div>
<div id="outline-container-org46f8a72" class="outline-2">
<h2 id="org46f8a72">The Review Cycle (spaced repetition)</h2>
<div class="outline-text-2" id="text-org46f8a72">
<p>
After creating v1 of any model, schedule your iterations:
</p>
<ul class="org-ul">
<li><b>v2</b>: 1 day later (tomorrow)</li>
<li><b>v3</b>: 3 days later</li>
<li><b>v4</b>: 1 week later</li>
<li><b>v5</b>: 1 month later</li>
<li><b>v6</b>: 3 months later etc..</li>
</ul>
</div>
</div>
<div id="outline-container-org5c1d9ec" class="outline-2">
<h2 id="org5c1d9ec">Mastery Check (stop here)</h2>
<div class="outline-text-2" id="text-org5c1d9ec">
<p>
Stop iterating only when you can check all three:
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Explain the concept cold without notes in under 2 minutes</li>
<li class="off"><code>[&#xa0;]</code> Solve a novel hard problem using this concept (not just a familiar template)</li>
<li class="off"><code>[&#xa0;]</code> Teach it to someone else without "ums," backtracking, or anxiety</li>
</ul>
</div>
</div>
<div id="outline-container-orgc09a1d0" class="outline-2">
<h2 id="orgc09a1d0">Daily Workflow</h2>
<div class="outline-text-2" id="text-orgc09a1d0">
<ol class="org-ol">
<li>For new concepts from lectures:
<ul class="org-ul">
<li>Dump in your notebook/scratchpad as usual</li>
<li>Wait until end of day (when partially forgotten)</li>
<li>Create v1 in your system <b>from memory</b></li>
<li>Set first review for tomorrow</li>
</ul></li>
<li>Check Index for today's "Next Review" dates</li>
<li>For each concept due:
<ul class="org-ul">
<li>Attempt to explain it from memory (Feynman)</li>
<li>Note where you got stuck in <b>Writing Inbox</b></li>
<li>Research the gaps in <b>Reading Inbox</b> (or what needs to be simplified)</li>
<li>Apply your changes to the model</li>
<li>Update to the next version (<b>My Model vX</b>) and update <b>Next Review</b> date</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org69529c5" class="outline-2">
<h2 id="org69529c5">Conclusion</h2>
<div class="outline-text-2" id="text-org69529c5">
<p>
That is it. This is what I've formulated as the ultimate note-taking technique which I wish I had known much earlier. Now one common problem is, what do you do with your already existing notes taken in between lectures, seminars or in the classroom? I would treat these notes simply as your <i>scratchpad</i>. You take them exactly as you've already been doing. Once you've given yourself enough time to <b>forget</b> these notes(preferrably at the end of the day), that is the perfect time to create or add to your <b>Model</b> from memory and follow the steps above.
</p>
</div>
</div>
<div id="outline-container-org7507ae3" class="outline-2">
<h2 id="org7507ae3">References</h2>
<div class="outline-text-2" id="text-org7507ae3">
<p>
[1] Piaget, J. (1952). The origins of intelligence in children. International Universities Press.
</p>

<p>
[2] Kornell, N., Hays, M. J., &amp; Bjork, R. A. (2009). Unsuccessful retrieval attempts enhance subsequent learning. Journal of Experimental Psychology: Learning, Memory, and Cognition, 35(4), 989–998.
</p>

<p>
[3] Anderson, J. R. (1983). The architecture of cognition. Harvard University Press.
(Also related: elaborative encoding; Craik, F. I. M., &amp; Tulving, E. (1975). Journal of Experimental Psychology: General, 104(3), 268–294.)
</p>

<p>
[4] Bjork, R. A. (1994). Memory and metamemory considerations in the training of human beings. In J. Metcalfe &amp; A. Shimamura (Eds.), Metacognition: Knowing about knowing (pp. 185–205). MIT Press.
</p>

<p>
[5] Chi, M. T. H., Bassok, M., Lewis, M. W., Reimann, P., &amp; Glaser, R. (1989). Self-explanations: How students study and use examples in learning to solve problems. Cognitive Science, 13(2), 145–182.
</p>

<p>
[6] Bransford, J. D., Brown, A. L., &amp; Cocking, R. R. (2000). How people learn: Brain, mind, experience, and school. National Academy Press.
</p>


<footer class="post-footer">
  <a href="../blog.html">← back to blog</a>
  <span>Published 02 Jan 2026</span>
</footer>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
